stress/stress.yml
config:
  target: "http://localhost:3000"
  processor: "./stress.js"
  phases:
    - duration: 30
      arrivalRate: 30
scenarios:
  - name: "arrive on the description page with id {{ id }}"
    flow:
      - loop: 
        - function: "generateRandomId"
        - get:
            url: "/rooms/{{id}}"
        - log: "{{id}}"
        count: 120