stress/stressremote.yml
config:
  target: "http://loadbalancer-airbnb-descriptions-1059579574.us-west-1.elb.amazonaws.com/api/rooms"
  processor: "./stress.js"
  phases:
    - duration: 10
      arrivalRate: 10
scenarios:
  - name: "arrive on the description page with id {{ id }}"
    flow:
      - loop:
        - function: "generateRandomId"
        - get:
            url: "/{{ id }}/description"
        count: 100